SELECT Н_ЛЮДИ.ОТЧЕСТВО, COUNT(Н_ЛЮДИ.ОТЧЕСТВО) AS "Кол-во" FROM Н_ЛЮДИ
WHERE Н_ЛЮДИ.ОТЧЕСТВО IN (
    SELECT Н_ЛЮДИ.ОТЧЕСТВО FROM Н_ЛЮДИ
        JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
        JOIN Н_УЧЕНИКИ USING (ВИД_ОБУЧ_ИД, ЧЛВК_ИД)
        JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
        JOIN Н_СТРОКИ_ПЛАНОВ ON Н_ПЛАНЫ.ИД = Н_СТРОКИ_ПЛАНОВ.ПЛАН_ИД
        JOIN Н_ДИСЦИПЛИНЫ ON Н_СТРОКИ_ПЛАНОВ.ДИС_ИД = Н_ДИСЦИПЛИНЫ.ИД
    WHERE Н_ДИСЦИПЛИНЫ.НАИМЕНОВАНИЕ = 'Вычислительная техника'
    GROUP BY Н_ЛЮДИ.ОТЧЕСТВО
    HAVING COUNT(Н_ЛЮДИ.ОТЧЕСТВО) < 10
    )
GROUP BY Н_ЛЮДИ.ОТЧЕСТВО;

