SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, ДАТА_РОЖДЕНИЯ FROM Н_ЛЮДИ
-- JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE ФАМИЛИЯ IN (
    SELECT ФАМИЛИЯ FROM (
        SELECT DISTINCT Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ, ФАМИЛИЯ FROM Н_ЛЮДИ
            JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
        ) AS DATA
    GROUP BY ФАМИЛИЯ
    HAVING COUNT(*) > 1)
ORDER BY ФАМИЛИЯ;

-- 会出现同姓不同名或父称，生日也不同的人
-- 并不能确定父称和名不同
SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, ДАТА_РОЖДЕНИЯ FROM Н_ЛЮДИ
WHERE ФАМИЛИЯ IN (
    SELECT ФАМИЛИЯ FROM Н_ЛЮДИ
    GROUP BY ФАМИЛИЯ
    HAVING count(DISTINCT "ДАТА_РОЖДЕНИЯ") > 1)
ORDER BY ФАМИЛИЯ;

SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
--     JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
--     JOIN Н_УЧЕНИКИ USING (ВИД_ОБУЧ_ИД, ЧЛВК_ИД)
WHERE ФАМИЛИЯ IN (
    SELECT ФАМИЛИЯ FROM (
        SELECT DISTINCT Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ, Н_УЧЕНИКИ.ЧЛВК_ИД, ФАМИЛИЯ FROM Н_ЛЮДИ
--             JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
--             JOIN Н_УЧЕНИКИ USING (ВИД_ОБУЧ_ИД, ЧЛВК_ИД)
        JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
        ) AS DATA
    GROUP BY ФАМИЛИЯ
    HAVING COUNT(*) > 1 AND COUNT(*) < 3)
ORDER BY ФАМИЛИЯ;

-- yes
SELECT DISTINCT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ IN (
    SELECT ФАМИЛИЯ
    FROM Н_ЛЮДИ
    GROUP BY ФАМИЛИЯ
    HAVING COUNT(DISTINCT Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ) > 1
)
ORDER BY ФАМИЛИЯ;
